```Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.service_account.google_service_account.sa_deployment: Refreshing state... [id=projects/bngo-app/serviceAccounts/service-account-tpv@bngo-app.iam.gserviceaccount.com]
module.service_account.google_service_account_iam_binding.serviceaccountuser-iam: Refreshing state... [id=projects/bngo-app/serviceAccounts/service-account-tpv@bngo-app.iam.gserviceaccount.com/roles/iam.serviceAccountUser]
module.gke.google_container_cluster.primary: Refreshing state... [id=projects/bngo-app/locations/europe-west1-c/clusters/tpv-gke-cluster]
module.service_account.google_service_account_iam_binding.viewer-iam: Refreshing state... [id=projects/bngo-app/serviceAccounts/service-account-tpv@bngo-app.iam.gserviceaccount.com/roles/viewer]
module.gke.google_container_node_pool.primary_preemptible_nodes: Refreshing state... [id=projects/bngo-app/locations/europe-west1-c/clusters/tpv-gke-cluster/nodePools/tpv-node-pool]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.service_account.google_project_iam_binding.cloud-run-admin-project-iam will be created
  + resource "google_project_iam_binding" "cloud-run-admin-project-iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:service-account-tpv@bngo-app.iam.gserviceaccount.com",
        ]
      + project = (known after apply)
      + role    = "roles/run.admin"
    }

  # module.service_account.google_project_iam_binding.kubernetes-engine-developer-project-iam will be created
  + resource "google_project_iam_binding" "kubernetes-engine-developer-project-iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:service-account-tpv@bngo-app.iam.gserviceaccount.com",
        ]
      + project = (known after apply)
      + role    = "roles/container.developer"
    }

  # module.service_account.google_project_iam_binding.serviceaccountuser-project-iam will be created
  + resource "google_project_iam_binding" "serviceaccountuser-project-iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:service-account-tpv@bngo-app.iam.gserviceaccount.com",
        ]
      + project = (known after apply)
      + role    = "roles/iam.serviceAccountUser"
    }

  # module.service_account.google_project_iam_binding.storage-admin-project-iam will be created
  + resource "google_project_iam_binding" "storage-admin-project-iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:service-account-tpv@bngo-app.iam.gserviceaccount.com",
        ]
      + project = (known after apply)
      + role    = "roles/storage.admin"
    }

  # module.service_account.google_project_iam_binding.viewer-project-iam will be created
  + resource "google_project_iam_binding" "viewer-project-iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:service-account-tpv@bngo-app.iam.gserviceaccount.com",
        ]
      + project = (known after apply)
      + role    = "roles/viewer"
    }

  # module.service_account.google_service_account_iam_binding.serviceaccountuser-iam will be destroyed
  - resource "google_service_account_iam_binding" "serviceaccountuser-iam" {
      - etag               = "BwWrD/SYg5Y=" -> null
      - id                 = "projects/bngo-app/serviceAccounts/service-account-tpv@bngo-app.iam.gserviceaccount.com/roles/iam.serviceAccountUser" -> null
      - members            = [
          - "serviceAccount:service-account-tpv@bngo-app.iam.gserviceaccount.com",
        ] -> null
      - role               = "roles/iam.serviceAccountUser" -> null
      - service_account_id = "projects/bngo-app/serviceAccounts/service-account-tpv@bngo-app.iam.gserviceaccount.com" -> null
    }

  # module.service_account.google_service_account_iam_binding.viewer-iam will be destroyed
  - resource "google_service_account_iam_binding" "viewer-iam" {
      - etag               = "BwWrD/SYg5Y=" -> null
      - id                 = "projects/bngo-app/serviceAccounts/service-account-tpv@bngo-app.iam.gserviceaccount.com/roles/viewer" -> null
      - members            = [
          - "serviceAccount:service-account-tpv@bngo-app.iam.gserviceaccount.com",
        ] -> null
      - role               = "roles/viewer" -> null
      - service_account_id = "projects/bngo-app/serviceAccounts/service-account-tpv@bngo-app.iam.gserviceaccount.com" -> null
    }

Plan: 5 to add, 0 to change, 2 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```